cask_args appdir: "/Applications"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "heroku/brew"

brew "neovim"
brew "git"
brew "jq"
brew "anyenv"
brew "openssl"
brew "readline"
brew "ruby-build"
brew "hub"
brew "heroku"
brew "circleci"
brew "the_silver_searcher"
brew "ctags"
brew "mitmproxy"
brew "telnet"
brew "libdvdcss"

# servers
brew "mysql"
brew "redis"

# Web Browsing and Develoment
cask "google-chrome"
cask "choosy"
cask "firefox"
cask "chromedriver"
cask "microsoft-edge"
cask "wechatwebdevtools"
cask "graphql-playground"

# Development Tools
cask "iterm2"
cask "docker-edge"
cask "vmware-fusion"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "java"
cask "corretto8"
cask "google-cloud-sdk"
cask "coteditor"
cask "postman"
cask "mysqlworkbench"
cask "ngrok"
cask "graphiql"
cask "sequel-pro-nightly"
cask "sf-symbols"
cask "another-redis-desktop-manager"

# Communication
cask "skype"
cask "zoomus"
cask "notion"
cask "microsoft-teams"
cask "discord"

# Security
cask "lastpass"
cask "authy"

# Office and Creative Suite
cask "adobe-creative-cloud"

# File and Media Management
cask "google-drive-file-stream"
cask "dropbox"
cask "weiyun"
cask "balenaetcher"
cask "onedrive"

# Input Methods and Helpers
cask "karabiner-elements"
cask "clipy"
cask "atok"
cask "sogouinput"

# Media
cask "iina"
cask "handbrake"
cask "makemkv"
cask "kobo"
cask "transmission"

# Utilities
cask "istat-menus5"
cask "cheatsheet"

# Device Drivers
cask "android-platform-tools"
cask "fujitsu-scansnap-home"

# VPN
cask "proxifier"
cask "shadowsocksx"
cask "v2rayu"
cask "openconnect-gui"
cask "tunnelblick"

# Crypto assets
cask "electrum"
cask "ledger-live"

## Mac App Store
mas "Xcode", id: 497799835
mas "Apple Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "GarageBand", id: 682658836
mas "Apple Configurator 2", id: 1037126344
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Microsoft PowerPoint", id: 462062816
mas "Evernote", id: 406056744
mas "LINE", id: 539883307
mas "WeChat", id: 836500024
mas "Slack", id: 803453959
mas "DingTalk", id: 1435447041
mas "Skitch", id: 425955336
mas "Magnet", id: 441258766
mas "ExSqueeze it", id: 680194796
mas "The Unarchiver", id: 425424353
mas "Theine", id: 955848755
mas "Be Focused Pro", id: 961632517
mas "Speedtest by Ookla", id: 1153157709
mas "Brother P-touch Editor", id: 1453365242
mas "radicoco", id: 1457683204
mas "TweetDeck by Twitter", id: 485812721
mas "Deliveries 3", id: 924726344

## Fonts
cask "font-source-han-code-jp"

## AWS
cask "amazon-workspaces"
